MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\USBFS.h
/*******************************************************************************
* File Name: USBFS.h
* Version 1.50
*
* Description:
*  Header File for the USFS component. Contains prototypes and constant values.
*
********************************************************************************
* Copyright 2008-2010, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
********************************************************************************/

#if !defined(CY_USBFS_USBFS_H)
#define CY_USBFS_USBFS_H

#include "cytypes.h"
#include "cydevice_trm.h"
#include "cyfitter.h"


/***************************************
* Conditional Compilation Parameters
***************************************/

/* PSoC3 ES2 or early */
#define USBFS_PSOC3_ES2  ((CYDEV_CHIP_MEMBER_USED == CYDEV_CHIP_MEMBER_3A) && \
                                     (CYDEV_CHIP_REVISION_USED <= CYDEV_CHIP_REVISION_3A_ES2))

/* PSoC5 ES1 or early */
#define USBFS_PSOC5_ES1  ((CYDEV_CHIP_MEMBER_USED == CYDEV_CHIP_MEMBER_5A) && \
                                     (CYDEV_CHIP_REVISION_USED <= CYDEV_CHIP_REVISION_5A_ES1))
/* PSoC3 ES3 or later */
#define USBFS_PSOC3_ES3  ((CYDEV_CHIP_MEMBER_USED == CYDEV_CHIP_MEMBER_3A) && \
                                     (CYDEV_CHIP_REVISION_USED > CYDEV_CHIP_REVISION_3A_ES2))

/* PSoC3 ES3 or early */
#define USBFS_PSOC3_UPTO_ES3 ((CYDEV_CHIP_MEMBER_USED == CYDEV_CHIP_MEMBER_3A) && \
                                         (CYDEV_CHIP_REVISION_USED <= CYDEV_CHIP_REVISION_3A_ES3))

/* PSoC5 ES2 or later */
#define USBFS_PSOC5_ES2  ((CYDEV_CHIP_MEMBER_USED == CYDEV_CHIP_MEMBER_5A) && \
                                     (CYDEV_CHIP_REVISION_USED > CYDEV_CHIP_REVISION_5A_ES1))


#if(USBFS_PSOC3_ES2)
    #include <intrins.h>
    #define USBFS_ISR_PATCH() _nop_(); _nop_(); _nop_(); _nop_(); _nop_(); _nop_(); _nop_(); _nop_();
#endif  /* End PSOC3_ES2 */


/***************************************
*  Memory Type Definitions
***************************************/

/* Renamed Type Definitions for backward compatibility. 
*  Should not be used in new designs. 
*/
#define USBFS_CODE CYCODE
#define USBFS_FAR CYFAR
#if defined(__C51__) || defined(__CX51__)
    #define USBFS_DATA data
    #define USBFS_XDATA xdata
#else
    #define USBFS_DATA
    #define USBFS_XDATA
#endif /* End __C51__ */


/***************************************
*    Initial Parameter Constants
***************************************/

#define USBFS_NUM_DEVICES   1
#define USBFS_ENABLE_DESCRIPTOR_STRINGS   
#define USBFS_ENABLE_MSOS_STRING   
#define USBFS_ENABLE_SN_STRING   
#define USBFS_ENABLE_STRINGS   

#define USBFS_MON_VBUS                       (0u)
#define USBFS_EXTERN_VND                     (0u)
#define USBFS_EXTERN_CLS                     (0u)
#define USBFS_MAX_INTERFACES_NUMBER          (1u)
#define USBFS_EP0_ISR_REMOVE                 (0u)
#define USBFS_EP1_ISR_REMOVE                 (0u)
#define USBFS_EP2_ISR_REMOVE                 (0u)
#define USBFS_EP3_ISR_REMOVE                 (1u)
#define USBFS_EP4_ISR_REMOVE                 (1u)
#define USBFS_EP5_ISR_REMOVE                 (1u)
#define USBFS_EP6_ISR_REMOVE                 (1u)
#define USBFS_EP7_ISR_REMOVE                 (1u)
#define USBFS_EP8_ISR_REMOVE                 (1u)


/***************************************
*    Data Struct Definition
***************************************/

typedef struct _USBFS_EpCtlBlock 
{
    uint8  attrib;
    uint8  apiEpState;
    uint8  hwEpState;
    uint8  epToggle;
    uint8  addr;
    uint8  epMode;
    uint16 buffOffset;
    uint16 bufferSize;
} T_USBFS_EP_CTL_BLOCK;

typedef struct _USBFS_EpSettingsBlock 
{
    uint8  interface;
    uint8  altSetting;
    uint8  addr;
    uint8  attributes;
    uint16 bufferSize;
    uint8  bMisc;
} T_USBFS_EP_SETTINGS_BLOCK;

typedef struct _USBFS_XferStatusBlock
{
    uint8  status;
    uint16 length;
} T_USBFS_XFER_STATUS_BLOCK;

typedef struct _USBFS_Td
{
    uint16  count;
    uint8   *pData;
    T_USBFS_XFER_STATUS_BLOCK *pStatusBlock;
} T_USBFS_TD;

typedef struct _USBFS_Lut
{
    uint8   c;
    void    *p_list;
} T_USBFS_LUT;

/* Resume/Suspend API Support */
typedef struct _USBFS_BackupStruct
{
    uint8 enableState;
    uint8 mode;
    
    uint8 pll;
    uint8 imo;
    uint32 clk;
} USBFS_BACKUP_STRUCT;


/* Renamed struct fields for backward compatibility. 
*  Should not be used in new designs. 
*/
#define wBuffOffset         buffOffset
#define wBufferSize         bufferSize
#define bStatus             status
#define wLength             length
#define wCount              count


/***************************************
*       Function Prototypes
***************************************/

void   USBFS_Start(uint8 device, uint8 mode);
void   USBFS_Init(void);
void   USBFS_InitComponent(uint8 device, uint8 mode);
void   USBFS_Stop(void) ;
uint8  USBFS_CheckActivity(void) ;
uint8  USBFS_GetConfiguration(void) ;
uint8  USBFS_GetInterfaceSetting(uint8 interfaceNumber) \
                                                        ;
uint8  USBFS_GetEPState(uint8 epNumber) ;
uint16 USBFS_GetEPCount(uint8 epNumber) ;
void   USBFS_LoadInEP(uint8 epNumber, uint8 *pData, uint16 length);
uint16 USBFS_ReadOutEP(uint8 epNumber, uint8 *pData, uint16 length);
void   USBFS_EnableOutEP(uint8 epNumber);
void   USBFS_DisableOutEP(uint8 epNumber) ;
void   USBFS_Force(uint8 bState) ;
uint8  USBFS_GetEPAckState(uint8 epNumber) ;
void   USBFS_SetPowerStatus(uint8 powerStatus);
uint8  USBFS_RWUEnabled(void) ;
void   USBFS_SerialNumString(uint8 *snString);

void   USBFS_Suspend(void);
void   USBFS_Resume(void) ;

#if (USBFS_MON_VBUS == 1u)
    uint8  USBFS_VBusPresent(void) ;
#endif /* End USBFS_MON_VBUS */

#if defined(CYDEV_BOOTLOADER_IO_COMP) && (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_USBFS)
    
    void CyBtldrCommStart(void);
    void CyBtldrCommStop(void);
    void CyBtldrCommReset(void);
    cystatus CyBtldrCommWrite(uint8 *pData, uint16 size, uint16 *count, uint8 timeOut);
    cystatus CyBtldrCommRead( uint8 *pData, uint16 size, uint16 *count, uint8 timeOut);

