MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\USBFS.h
#define USBFS_EP_1_PRIOR         USBFS_ep_1__INTC_PRIOR_NUM
#define USBFS_EP_1_MASK          USBFS_ep_1__INTC_MASK
#define USBFS_EP_1_VECT_NUM      USBFS_ep_1__INTC_NUMBER

#define USBFS_EP_2_PRIOR         USBFS_ep_2__INTC_PRIOR_NUM
#define USBFS_EP_2_MASK          USBFS_ep_2__INTC_MASK
#define USBFS_EP_2_VECT_NUM      USBFS_ep_2__INTC_NUMBER

#define USBFS_EP_3_PRIOR         USBFS_ep_3__INTC_PRIOR_NUM
#define USBFS_EP_3_MASK          USBFS_ep_3__INTC_MASK
#define USBFS_EP_3_VECT_NUM      USBFS_ep_3__INTC_NUMBER

#define USBFS_EP_4_PRIOR         USBFS_ep_4__INTC_PRIOR_NUM
#define USBFS_EP_4_MASK          USBFS_ep_4__INTC_MASK
#define USBFS_EP_4_VECT_NUM      USBFS_ep_4__INTC_NUMBER

#define USBFS_EP_5_PRIOR         USBFS_ep_5__INTC_PRIOR_NUM
#define USBFS_EP_5_MASK          USBFS_ep_5__INTC_MASK
#define USBFS_EP_5_VECT_NUM      USBFS_ep_5__INTC_NUMBER

#define USBFS_EP_6_PRIOR         USBFS_ep_6__INTC_PRIOR_NUM
#define USBFS_EP_6_MASK          USBFS_ep_6__INTC_MASK
#define USBFS_EP_6_VECT_NUM      USBFS_ep_6__INTC_NUMBER

#define USBFS_EP_7_PRIOR         USBFS_ep_7__INTC_PRIOR_NUM
#define USBFS_EP_7_MASK          USBFS_ep_7__INTC_MASK
#define USBFS_EP_7_VECT_NUM      USBFS_ep_7__INTC_NUMBER

#define USBFS_EP_8_PRIOR         USBFS_ep_8__INTC_PRIOR_NUM
#define USBFS_EP_8_MASK          USBFS_ep_8__INTC_MASK
#define USBFS_EP_8_VECT_NUM      USBFS_ep_8__INTC_NUMBER

#define USBFS_DP_INTC_PRIOR      USBFS_dp_int__INTC_PRIOR_NUM
#define USBFS_DP_INTC_MASK       USBFS_dp_int__INTC_MASK
#define USBFS_DP_INTC_VECT_NUM   USBFS_dp_int__INTC_NUMBER


/***************************************
 *  Endpoint 0 offsets (Table 9-2)
 **************************************/

#define USBFS_bmRequestType      USBFS_EP0_DR0_PTR
#define USBFS_bRequest           USBFS_EP0_DR1_PTR
#define USBFS_wValue             USBFS_EP0_DR2_PTR
#define USBFS_wValueHi           USBFS_EP0_DR3_PTR
#define USBFS_wValueLo           USBFS_EP0_DR2_PTR
#define USBFS_wIndex             USBFS_EP0_DR4_PTR
#define USBFS_wIndexHi           USBFS_EP0_DR5_PTR
#define USBFS_wIndexLo           USBFS_EP0_DR4_PTR
#define USBFS_length             USBFS_EP0_DR6_PTR
#define USBFS_lengthHi           USBFS_EP0_DR7_PTR
#define USBFS_lengthLo           USBFS_EP0_DR6_PTR


/***************************************
*       Register Constants
***************************************/
#define USBFS_VDDD_MV                    CYDEV_VDDD_MV
#define USBFS_3500MV                     (3500u)

#define USBFS_CR1_REG_ENABLE             (0x01u)
#define USBFS_CR1_ENABLE_LOCK            (0x02u)
#define USBFS_CR1_BUS_ACTIVITY_SHIFT     (0x02u)
#define USBFS_CR1_BUS_ACTIVITY           (0x01u << USBFS_CR1_BUS_ACTIVITY_SHIFT)
#if(USBFS_PSOC3_ES3 || USBFS_PSOC5_ES2)
    #define USBFS_CR1_TRIM_MSB_EN            (0x08u)
#endif /* End USBFS_PSOC3_ES3 || USBFS_PSOC5_ES2 */    

#define USBFS_EP0_CNT_DATA_TOGGLE        (0x80u)
#define USBFS_EPX_CNT_DATA_TOGGLE        (0x80u)
#define USBFS_EPX_CNT0_MASK              (0x07u)
#define USBFS_EPX_CNTX_ADDR_SHIFT        (0x04u)
#define USBFS_EPX_CNTX_CRC_COUNT         (0x02u)
#define USBFS_EPX_DATA_BUF_MAX           (512u)

#define USBFS_CR0_ENABLE                 (0x80u)

#if(USBFS_PSOC3_ES2 || USBFS_PSOC5_ES1)
    #define USBFS_USBIO_CR1_IOMODE           (0x80u)
    #define USBFS_USBIO_CR1_DRIVE_MODE       (0x40u)
    #define USBFS_USBIO_CR1_DPI              (0x20u)
    #define USBFS_USBIO_CR1_DMI              (0x10u)
    #define USBFS_USBIO_CR1_P2PUEN           (0x08u)
#else  /* USBFS_PSOC3_ES3 || USBFS_PSOC5_ES2 */  
    #define USBFS_USBIO_CR1_IOMODE           (0x20u)
#endif /* End USBFS_PSOC3_ES2 || USBFS_PSOC5_ES1 */    
#define USBFS_USBIO_CR1_USBPUEN          (0x04u)
#define USBFS_USBIO_CR1_DP0              (0x02u)
#define USBFS_USBIO_CR1_DM0              (0x01u)

#define USBFS_USBIO_CR0_TEN              (0x80u)
#define USBFS_USBIO_CR0_TSE0             (0x40u)
#define USBFS_USBIO_CR0_TD               (0x20u)
#define USBFS_USBIO_CR0_RD               (0x01u)

#define USBFS_FASTCLK_IMO_CR_USBCLK_ON   (0x40u)
#define USBFS_FASTCLK_IMO_CR_XCLKEN      (0x20u)
#define USBFS_FASTCLK_IMO_CR_FX2ON       (0x10u)

#define USBFS_ARB_EPX_CFG_RESET          (0x08u)
#define USBFS_ARB_EPX_CFG_CRC_BYPASS     (0x04u)
#define USBFS_ARB_EPX_CFG_DMA_REQ        (0x02u)
#define USBFS_ARB_EPX_CFG_IN_DATA_RDY    (0x01u)

#define USBFS_SIE_EP_INT_EP1_MASK        (0x01u)
#define USBFS_SIE_EP_INT_EP2_MASK        (0x02u)
#define USBFS_SIE_EP_INT_EP3_MASK        (0x04u)
#define USBFS_SIE_EP_INT_EP4_MASK        (0x08u)
#define USBFS_SIE_EP_INT_EP5_MASK        (0x10u)
#define USBFS_SIE_EP_INT_EP6_MASK        (0x20u)
#define USBFS_SIE_EP_INT_EP7_MASK        (0x40u)
#define USBFS_SIE_EP_INT_EP8_MASK        (0x80u)

#define USBFS_PM_ACT_EN_FSUSB            USBFS_USB__PM_ACT_MSK
#define USBFS_PM_STBY_EN_FSUSB           USBFS_USB__PM_STBY_MSK
#define USBFS_PM_AVAIL_EN_FSUSBIO        (0x10u)

#define USBFS_PM_USB_CR0_REF_EN          (0x01u)
#define USBFS_PM_USB_CR0_PD_N            (0x02u)
#define USBFS_PM_USB_CR0_PD_PULLUP_N     (0x04u)

#define USBFS_USB_CLK_ENABLE             (0x01u)

#define USBFS_BUS_RST_COUNT              (0x03u)

#define USBFS_DM_MASK                    USBFS_Dm__0__MASK
#define USBFS_DP_MASK                    USBFS_Dp__0__MASK


#endif /* End CY_USBFS_USBFS_H */


/* [] END OF FILE */
